examples/farm/performance/test-plans/example-full-graph.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Farm Full Graph Stress Test" enabled="true">
      <stringProp name="TestPlan.comments">Stress test with 1M lay reports: 10 farms, 100 coops/farm, 100 hens/coop, 100 lay_reports/hen</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">http://localhost:3033</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="NUM_FARMS" elementType="Argument">
            <stringProp name="Argument.name">NUM_FARMS</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="COOPS_PER_FARM" elementType="Argument">
            <stringProp name="Argument.name">COOPS_PER_FARM</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="HENS_PER_COOP" elementType="Argument">
            <stringProp name="Argument.name">HENS_PER_COOP</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="LAY_REPORTS_PER_HEN" elementType="Argument">
            <stringProp name="Argument.name">LAY_REPORTS_PER_HEN</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <!-- Setup Thread Group: Create test data using bulk API -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Setup - Create Test Data (Bulk)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- Create 10 Farms in bulk -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Bulk - Create ${NUM_FARMS} Farms" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[
  {"name":"Farm-1"},{"name":"Farm-2"},{"name":"Farm-3"},{"name":"Farm-4"},{"name":"Farm-5"},
  {"name":"Farm-6"},{"name":"Farm-7"},{"name":"Farm-8"},{"name":"Farm-9"},{"name":"Farm-10"}
]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3033</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/farm/api/bulk</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Farm IDs" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">farmIds</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$[*]</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">-1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>

        <!-- JSR223 Sampler to generate and POST coops in bulk (100 per farm = 1000 total) -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Bulk - Create Coops (100 per farm)" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import groovy.json.JsonBuilder
import org.apache.http.client.methods.HttpPost
import org.apache.http.entity.StringEntity
import org.apache.http.impl.client.HttpClients
import org.apache.http.util.EntityUtils

def farmIdsStr = vars.get("farmIds")
def farmIds = farmIdsStr.tokenize("/farm/api/").findAll { it.trim() }

log.info("Creating ${vars.get('COOPS_PER_FARM')} coops for each of ${farmIds.size()} farms")

def allCoopIds = []

farmIds.each { farmId ->
    def coops = []
    def coopsPerFarm = vars.get("COOPS_PER_FARM").toInteger()

    for (int i = 1; i &lt;= coopsPerFarm; i++) {
        coops.add([
            name: "Farm-${farmId.take(8)}-Coop-${i}",
            farm_id: farmId
        ])
    }

    // Post coops in batches of 100
    def batchSize = 100
    for (int batch = 0; batch &lt; coops.size(); batch += batchSize) {
        def end = Math.min(batch + batchSize, coops.size())
        def batchCoops = coops[batch..&lt;end]

        def httpClient = HttpClients.createDefault()
        def post = new HttpPost("http://localhost:3033/coop/api/bulk")
        post.setHeader("Content-Type", "application/json")

        def json = new JsonBuilder(batchCoops).toString()
        post.setEntity(new StringEntity(json))

        def response = httpClient.execute(post)
        def responseBody = EntityUtils.toString(response.getEntity())

        // Extract coop IDs from response
        responseBody.tokenize("/coop/api/").findAll { it.trim() }.each { coopId ->
            allCoopIds.add(coopId.replaceAll('"', '').replaceAll(',', '').replaceAll(']', '').trim())
        }

        httpClient.close()
        log.info("Created batch ${batch/batchSize + 1} of coops for farm ${farmId.take(8)}")
    }
}

vars.put("allCoopIds", allCoopIds.join(","))
vars.put("numCoops", allCoopIds.size().toString())
log.info("Total coops created: ${allCoopIds.size()}")
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>

        <!-- JSR223 Sampler to generate and POST hens in bulk (100 per coop = 100K total) -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Bulk - Create Hens (100 per coop)" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import groovy.json.JsonBuilder
import org.apache.http.client.methods.HttpPost
import org.apache.http.entity.StringEntity
import org.apache.http.impl.client.HttpClients
import org.apache.http.util.EntityUtils

def coopIdsStr = vars.get("allCoopIds")
def coopIds = coopIdsStr.split(",")

log.info("Creating ${vars.get('HENS_PER_COOP')} hens for each of ${coopIds.size()} coops")

def allHenIds = []
def hensPerCoop = vars.get("HENS_PER_COOP").toInteger()
def batchSize = 100

def henCounter = 0

coopIds.each { coopId ->
    def hens = []

    for (int i = 1; i &lt;= hensPerCoop; i++) {
        hens.add([
            name: "Hen-${henCounter++}",
            coop_id: coopId,
            eggs: (Math.random() * 11).toInteger(),
            dob: "2024-01-01"
        ])
    }

    // Post hens in batches
    for (int batch = 0; batch &lt; hens.size(); batch += batchSize) {
        def end = Math.min(batch + batchSize, hens.size())
        def batchHens = hens[batch..&lt;end]

        def httpClient = HttpClients.createDefault()
        def post = new HttpPost("http://localhost:3033/hen/api/bulk")
        post.setHeader("Content-Type", "application/json")

        def json = new JsonBuilder(batchHens).toString()
        post.setEntity(new StringEntity(json))

        def response = httpClient.execute(post)
        def responseBody = EntityUtils.toString(response.getEntity())

        // Extract hen IDs
        responseBody.tokenize("/hen/api/").findAll { it.trim() }.each { henId ->
            allHenIds.add(henId.replaceAll('"', '').replaceAll(',', '').replaceAll(']', '').trim())
        }

        httpClient.close()
    }

    if ((coopIds.indexOf(coopId) + 1) % 100 == 0) {
        log.info("Processed ${coopIds.indexOf(coopId) + 1}/${coopIds.size()} coops")
    }
}

vars.put("allHenIds", allHenIds.join(","))
vars.put("numHens", allHenIds.size().toString())
log.info("Total hens created: ${allHenIds.size()}")
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>

        <!-- JSR223 Sampler to generate and POST lay_reports in bulk (100 per hen = 10M total) -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Bulk - Create Lay Reports (100 per hen = 1M total)" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import groovy.json.JsonBuilder
import org.apache.http.client.methods.HttpPost
import org.apache.http.entity.StringEntity
import org.apache.http.impl.client.HttpClients
import org.apache.http.util.EntityUtils

def henIdsStr = vars.get("allHenIds")
def henIds = henIdsStr.split(",")

def layReportsPerHen = vars.get("LAY_REPORTS_PER_HEN").toInteger()
def timeOfDays = ["morning", "afternoon", "evening"]

log.info("Creating ${layReportsPerHen} lay reports for each of ${henIds.size()} hens")

def totalReports = 0
def batchSize = 500  // Larger batches for lay reports

def layReports = []

henIds.eachWithIndex { henId, idx ->
    for (int i = 0; i &lt; layReportsPerHen; i++) {
        layReports.add([
            hen_id: henId,
            time_of_day: timeOfDays[(int)(Math.random() * timeOfDays.size())],
            eggs: (Math.random() * 4).toInteger()
        ])
    }

    // Post in batches
    if (layReports.size() &gt;= batchSize) {
        def httpClient = HttpClients.createDefault()
        def post = new HttpPost("http://localhost:3033/lay_report/api/bulk")
        post.setHeader("Content-Type", "application/json")

        def json = new JsonBuilder(layReports).toString()
        post.setEntity(new StringEntity(json))

        def response = httpClient.execute(post)
        totalReports += layReports.size()

        httpClient.close()
        layReports.clear()

        if (totalReports % 10000 == 0) {
            log.info("Created ${totalReports} lay reports so far...")
        }
    }
}

// Post remaining
if (layReports.size() &gt; 0) {
    def httpClient = HttpClients.createDefault()
    def post = new HttpPost("http://localhost:3033/lay_report/api/bulk")
    post.setHeader("Content-Type", "application/json")

    def json = new JsonBuilder(layReports).toString()
    post.setEntity(new StringEntity(json))

    def response = httpClient.execute(post)
    totalReports += layReports.size()

    httpClient.close()
}

vars.put("numLayReports", totalReports.toString())
log.info("Total lay reports created: ${totalReports}")
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>

        <!-- Log setup completion -->
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Setup Complete" enabled="true">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree/>
      </hashTree>

      <!-- Load Test Thread Group: GraphQL queries with DataLoader stress test -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Load Test - GraphQL with DataLoader" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- Select random IDs from created data -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Select Random Test IDs" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">def farmIdsStr = vars.get("farmIds")
def farmIds = farmIdsStr.tokenize("/farm/api/").findAll { it.trim() }
vars.put("randomFarmId", farmIds[(int)(Math.random() * farmIds.size())])

def coopIds = vars.get("allCoopIds").split(",")
vars.put("randomCoopId", coopIds[(int)(Math.random() * coopIds.size())])

def henIds = vars.get("allHenIds").split(",")
vars.put("randomHenId", henIds[(int)(Math.random() * henIds.size())])
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>

        <!-- GraphQL Query: Coop with all Hens and their Lay Reports (DataLoader stress test!) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GraphQL - Coop with Hens + Lay Reports (DataLoader Test)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"query":"{ getById(id: \"${randomCoopId}\") { id name farm { id name } hens { id name eggs layReports { id time_of_day eggs } } } }"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3033</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/coop/graph</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <!-- GraphQL Query: Farm with all Coops (existing test) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GraphQL - Farm with Coops" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"query":"{ getById(id: \"${randomFarmId}\") { id name coops { id name hens { id name eggs } } } }"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3033</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/farm/graph</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <!-- GraphQL Query: Hen with Lay Reports -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GraphQL - Hen with Lay Reports" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"query":"{ getById(id: \"${randomHenId}\") { id name eggs coop { id name } layReports { id time_of_day eggs } } }"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3033</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/hen/graph</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>